#### Terraform Format and Style 🖌#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.groundwork.module.network_gcp.google_compute_firewall.firewall will be created
  + resource "google_compute_firewall" "firewall" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "direct-link-325016-groundwork"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "direct-link-325016"
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)

      + allow {
          + ports    = [
              + "443",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # module.groundwork.module.network_gcp.google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 1460
      + name                            = "groundwork"
      + project                         = "direct-link-325016"
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.groundwork.module.network_gcp.google_compute_subnetwork.subnetworks["rede-us-central1"] will be created
  + resource "google_compute_subnetwork" "subnetworks" {
      + creation_timestamp         = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.0.0.0/16"
      + name                       = "rede-us-central1"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "direct-link-325016"
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
    }

  # module.groundwork.module.network_gcp.google_compute_subnetwork.subnetworks["rede-us-west1"] will be created
  + resource "google_compute_subnetwork" "subnetworks" {
      + creation_timestamp         = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.10.0.0/16"
      + name                       = "rede-us-west1"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "direct-link-325016"
      + region                     = "us-west1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnets_id = [
      + {
          + creation_timestamp         = (known after apply)
          + description                = null
          + fingerprint                = (known after apply)
          + gateway_address            = (known after apply)
          + id                         = (known after apply)
          + ip_cidr_range              = "10.0.0.0/16"
          + log_config                 = []
          + name                       = "rede-us-central1"
          + network                    = (known after apply)
          + private_ip_google_access   = null
          + private_ipv6_google_access = (known after apply)
          + project                    = "direct-link-325016"
          + region                     = "us-central1"
          + secondary_ip_range         = (known after apply)
          + self_link                  = (known after apply)
          + timeouts                   = null
        },
      + {
          + creation_timestamp         = (known after apply)
          + description                = null
          + fingerprint                = (known after apply)
          + gateway_address            = (known after apply)
          + id                         = (known after apply)
          + ip_cidr_range              = "10.10.0.0/16"
          + log_config                 = []
          + name                       = "rede-us-west1"
          + network                    = (known after apply)
          + private_ip_google_access   = null
          + private_ipv6_google_access = (known after apply)
          + project                    = "direct-link-325016"
          + region                     = "us-west1"
          + secondary_ip_range         = (known after apply)
          + self_link                  = (known after apply)
          + timeouts                   = null
        },
    ]
  + vpc_id     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
**Pusher**: @snifbr
**Action**: pull_request
